app/Controllers/Admin.php

    private function checkUser (){
    if($this->session->get("logged_in")==false || $this->session->get("user")==""){
---
SELECT *
FROM `users`

    public function posts(){
        // if(!$this->checkUser()){
        //     return redirect()-> to("/admin/login");
        //  };


         $posts = [];
        $builder = $this->db->table('posts');
        $query = $builder->get();
---
SELECT *
FROM `posts`

    public function create_post(){

        $data = $this->request->getPost();
        $builder = $this->db->table('posts');
       $result = $builder->insert([
            'post_title'=>$data["name"],
            'post_content'=>$data["message"]
        ]);
---
INSERT INTO `posts` (`post_title`, `post_content`) VALUES ('tests', '<h1><strong>teksts</strong></h1><p>tests</p><p>&nbsp;</p>')